class TitleCleaner {
  final unwantedWords = [
    'دانلود آهنگ', 'آهنگ جدید', 'اصلی', 'MP3', 'کامل', 'با متن کامل', 'کیفیت عالی',
    'آونگ موزیک', 'کیفیت بالا', 'با متن کامل', 'آونگ موزیک', 'بالاترین کیفیت', 'بهترین کیفیت',
    'کیفیت عالی', 'دانلود', 'آهنگ', '128 و', '320 و', 'جدید', 'تکی و یکجا', 'آلبوم',
    ' و|', '.', '+', '-', '(', ')', '[', ']', '{','}', '/', '\\', '|', ':', ';',
    ' با متن و ', 'دو کیفیت', 'موزیکفا', 'با متن', 'بهترین کیفیت ورژن اصلی', ' بالا ترین متن کامل', 'بالاترین', 'کیفیت', 'بهترین کیفیت', 'اصلی', 'پخش آنلاین موزیک', 'کیفیت بالا', 'متن', 'موزیک',
    'ورژن', 'اصلی', '128', '320', 'دانلود', 'آهنگ', 'جدید', 'MP3', 'اصلی', 'کامل', 'بامتن', 
    'کیفیت بالا', 'پخش آنلاین', 'ورژن', 'تکی', 'یکجا', 
    'آونگ موزیک', 'هم اکنون', 'با صدای','.','ـ','،','ٍ',',','•','بامتن'
  ];

  String cleanTitle(String title) {
    for (String word in unwantedWords) {
      title = title.replaceAll(word, '');
    }
    return title.trim();
  }

  String extractArtistAndSongTitle(String title) {
    // پاکسازی تایتل
    String cleanedTitle = cleanTitle(title);
    // جدا کردن نام خواننده و نام آهنگ بر اساس یک قاعده مشخص
    List<String> parts = cleanedTitle.split(' ');
    if (parts.length > 1) {
      return parts[0] + ' ' + parts[1]; // فرض می‌کنیم که قسمت اول نام خواننده و قسمت دوم نام آهنگ است
    }
    return cleanedTitle;
  }
}
