// کلاس مدیریت پاکسازی تایتل‌ها
class TitleCleaner {
  final unwantedWords = [
    'دانلود آهنگ', 'آهنگ جدید', 'اصلی', 'MP3', 'کامل', 'با متن کامل', 'کیفیت عالی',
    'آونگ موزیک', 'کیفیت بالا', 'با متن کامل', 'آونگ موزیک', 'بالاترین کیفیت', 'بهترین کیفیت',
    'کیفیت عالی', 'دانلود', 'آهنگ', '128 و', '320 و', 'جدید', 'تکی و یکجا', 'آلبوم',
    ' و|', '.', '+', '-', '(', ')', '[', ']', '{', '}', '/', '\\', '|', ':', ';',
    ' با متن و ', 'دو کیفیت', 'موزیکفا', 'با متن', 'بهترین کیفیت ورژن اصلی', ' بالا ترین متن کامل', 'بالاترین', 'کیفیت', 'بهترین کیفیت', 'اصلی', 'پخش آنلاین موزیک', 'کیفیت بالا', 'متن', 'موزیک',
    'ورژن', 'اصلی', '128', '320',
  ];

  String cleanTitle(String title) {
    for (String word in unwantedWords) {
      title = title.replaceAll(word, '');
    }
    return title.trim();
  }
}